#!/usr/bin/env python
# -*- coding: utf-8 -*-
#คำอธิบายยยยยยยยยยยยยยยยยยยยยยยยยยยยยยยยยยยยยยยยยยยยยยยยยยยยยยยยยยยยยยยยยยยยยยยยยยยยยยยยยยยยยยยยยยยยยยยยยยยยยยย
codename = ("""อ่านว่า "โค้ดเนม" เด้อ เป็นชื่อรหัสประจำโทรศัพท์
Poco X3 Pro     <b>vayu</b>
Redmi 9t          <b>lime</b>
Redmi Note 10   <b>mojito</b>    
""")
###########################################################################
x3p = """
        <b>------------     Poco X3 Pro     ------------</b>

เลือกรอมที่ต้องการได้เลยย 😉"""

x3peu = """
        <b>------------     Poco X3 Pro     ------------</b>
        <b>------------ EU ROM  ------------</b>

เลือกเวอร์ชันที่ต้องการได้เลยย 😉"""
Magisk = ("""<b>--------------  ขั้นตอนการรูทเครื่อง  --------------</b>

1. <a href="https://magiskmanager.com/downloading-magisk-manager">โหลดแอพได้ที่นี่</a>
2. เปลี่ยนชื่อไฟล์ <code>magisk.apk</code> ให้เป็น <code>magisk.zip</code>
3. เข้าโหมด Recovery (TWRP, Ofox, PBRP, และอื่นๆ)
4. เลือกไฟล์ <code>magisk.zip</code> แล้วเลื่อนแถบด้านล่าง
5. แฟลชเสร็จแล้วรีบูต
6. เปิดเครื่องมาจะมีแอพชื่อ Magisk มา ให้เปิดแอพแล้วรอ
7. จะมีหน้าต่างให้ติดตั้ง แล้วกดติดตั้ง
8. พอติดตั้งเสร็จแล้วให้เปิดแอพ ถ้ารูทผ่านจะมีแถบเมนูด้านล่าง

ปล. ในขั้นตอนที่ 4 แนะนำให้สำรอง Boot ไว้ เผื่อเปิดเครื่องไม่ติด
""")

getapps = ("""ลิงก์ด้านล่างเลย อย่าลืมแตกไฟล์ด้วยนะ""")

trcamera = ("""โหลดลิงก์ด้านล่าง จะมีไฟล์ config กับตัว apk ไว้แล้ว
""")

trhelp = ("""
(อ่านหน่อย ไม่ยาวหรอก)

<b>-----วิธีใช้-----</b>
1. โหลดไฟล์จากข้างบนมาไว้ในเครื่อง
2. ติดตั้งตัวแอพ trCamera
3. เข้าแอพแล้วเลื่อนหน้าจอลงมา กดที่การตั้งค่ามุมขวาล่าง
4. เลื่อนลงมาล่างสุด เลือก Configs
5. เลือก Save และกด Save อีกรอบ
6. นำไฟล์ config ที่อยู่ในโฟลเดอร์เดียวกัน ไปวางที่ trCamera -> XMLConfigs แล้วกดวาง
7. ปัดแอพทิ้งให้หมดแล้วเข้าแอพ trcamera ใหม่
8. แตะตรงระหว่างปุ่มชัตเตอร์กับรูปภาพสองครั้ง แล้วเลือกไฟล์ที่ต้องการ

<b>-----บัคของแอพ-----</b>
1. ไม่สามารถใช้เลนมาโครและเลนไวด์ได้
2. ตัวแอพจะมีอาการค้างบางครั้ง แก้ได้โดยปิดแล้วเปิดใหม่

""")
preun = ("""ขั้นตอนการปลดล็อก Bootloader

----- เตรียมสิ่งเหล่านี้ให้พร้อม -----
1. บัญชี Mi Account
2. คอมพิวเตอร์
2. Mi Flash unlock
3. อินเทอร์เน็ต
4. ลง ADB Driver
""")

adbin = ("""<b>----- ขั้นตอนการลง ADB Driver -----</b>
ลง ADB Driver ก่อน
1. โหลดไฟล์ ADB มาแล้วแตกไฟล์
2. เปิดโปรแกรม 15 Second ADB
3. พิมพ์ Y แล้วกด Enter ไปเรื่อย จนกว่าโปรแกรมจะปิด
4. ลง ADB สำเร็จ

(เสริม) พอลง ADB เสร็จให้เช็กว่าลงสำเร็จมั้ยโดยกดปุ่ม Start แล้วค้นหา cmd จะได้หน้าต่างสีดำขึ้นมา
ให้พิมพ์ <code>adb devices</code> แล้วกด Enter ถ้าลงผ่านจะได้ตามรูปนี้ ถ้าไม่มีให้ลงใหม่อีกครั้ง

ปล. คำสั่ง adb ห้ามลืม s นะ
""")

unlock = ("""<b>----- ขั้นตอนการปลดล็อก Bootloader -----</b>
(ส่วนมือถือ)
ลง ADB และต่อสายเข้าคอมพิวเตอร์ให้เรียบร้อย
1. ลงทะเบียนบัญชี Mi account
2. กดเพิ่มบัญชีและอุปกรณ์ในการตั้งการ ในโหมดนักพัฒนา
3. โหลดโปรแกรม Mi Flash unlock จากลิงค์ด้านล่าง
4. ให้มือถือเข้าสู่โหมด Fastboot ไว้โดยปิดเครื่องให้ดับสนิท
5. กดปุ่มเปิดเครื่องพร้อมกับปุ่มลดเสียง
6. พอหน้า Fastboot ขึ้นมาให้กดปลดล็อกในคอม

(ส่วนคอม)
7. เปิดโฟลเดอร์ Mi Flash unlock แล้วเปิดโปรแกรม <code>miflash_unlock</code>
8. กด Agree แล้วลงทะเบียนโดยใช้บัญชี Mi account
9. กด Unlock แล้วรอให้ครบ 168 ชม(เวลาอาจแตกต่างกันออกไป).
10. ถ้าครบเวลาแล้ว ตัวเครื่องจะมีการรีสตาร์ทอัตโนมัติ พร้อมกับสังเกตรูปปลดล็อกแล้วอยู่ใต้กล้อง""")

Messenger = ("""<b>---------  การทำให้ Messenger เป็นวงกลม  ---------</b>

โหลดตัวนี้มา ->>>> <a href='https://drive.google.com/file/d/1xFHARBHISqctJKHOa1OEDXEyBLOC-F7a/view?usp=sharing'>จิ้มที่นี่เลยจ้า</a>
1. โหลดเสร็จแล้วแตกไฟล์
2. ติดตั้ง ChatHeadEnabler-v2.2.1
3. ติดตั้ง Facebook-v342.0.0.37.119
4. ติดตั้ง Messenger-v336.0.0.13.142
5. ล็อกอินให้เรียบร้อยแล้วเข้าไปในแอพ Messenger
6. กดที่รูปโปรไฟล์มุมขวาบนแล้วเลื่อนหา Chat Heads แล้วกดเปิด
7. เรียบร้อยจ้า
""")

textup = ("""
<b>คำเตือน!!! นี่คือขั้นตอนการอัพเดตรอมนะจ๊ะ ไม่ใช่การแฟลชรอมใหม่ </b>

ถ้าพร้อมแล้ว กดถัดไปด่านล่างได้เลย
""")

start = ("""สวัสดี คุณ <b>{name}!</b>
จิ้ม --> /help เพื่อดูฟังก์ชันเพิ่มเติม
จิ้ม --> /ver เพื่อดูการอัพเดตฟังก์ชัน""")

upfirst = ("""
อันดับแรก ปิดเครื่องแล้วรอให้เครื่องดับสนิท พอเครื่องดับสนิทแล้วให้เข้าสู่ Recovery โดยทำการกดปุ่ม Power และปุ่ม Volume + แล้วจะได้หน้าตาประมาณนี้
""")

upfirst1 = ("""
อันดับที่สอง เลือกเมนู <b>Wipe</b> แล้วเลือก <b>Advanced Wipe</b>
""")

up_wipe = ("""
อันดับที่สาม ติ๊กเครื่องหมายที่ <b>Dalvik/ART Cache</b> แล้วเลื่อนแถบด้านล่าง

ปล. ถ้าเครื่องไหนมีเมนู <b>Cache</b> อีกหนึ่งเมนู ให้ติ๊กด้วยนะ ถ้าเครื่องไหนไม่มีไม่ติ๊กก็ได้""")

up_wipex = ("""
แล้วจะได้หน้าตาประมาณนี้

ปล. ที่ติดแดงคือใส่รหัสเข้า twrp ผิดเฉยๆ 😂
""")

up_in = ("""
หลังจาก <b>WIPE Cache/ART Cache</b> เสร็จแล้ว ให้เข้าเมนู <b>Install</b>
""")

up_in1 = ("""เลือกรอมที่จะอัพเดต
ปล. ถ้าไฟล์รอมอยู่ภายนอกเครื่อง ให้เลือก <b>Select Storage</b> ที่มุมล่างซ้าย แล้วเลือกที่จัดเก็บถายนอกได้เลย
""")

up_in2 = ("""หน้านี้คือหน้าสรุปรายการ เช็กความเรียบร้อยแล้วเลื่อนแถบด้านล่าง เพื่อติดตั้งได้เลย""")
up_in3 = ("""พอแฟลชผ่าน จะขึ้นหน้าตาแบบนี้ รีบูตได้เลย!
ปล. แนะนำให้กด Wipe Cache ด้านล่างซ้ายมือด้วย แล้วค่อยรีบูตเครื่อง 😉""")

userid = (1735717429)

ver = ("""      <b>--------------------  THxMz Bot   --------------------</b>
        <b>--------------  Version 1.3   --------------</b>

<b>Version 1</b>
v. 1.0 - ปรับเปลี่ยนเมนูใหม่ และระบบยืนยันตัวตน
v. 1.1 - เพิ่มเมนูตารางเรียนและรายชื่อนักเรียน 5/2
v. 1.1.2 - เพิ่มเมนู trCamera
v. 1.3 - ปรับเปลี่ยนเมนูใหม่ และเพิ่มเมนูโอนเงิน
v. 1.4 - สามารถเรียกใช้เมนูโดยไม่ต้องเรียกคำสั่งใหม่

<b>Version 2</b>
v. 2 - เพิ่มฟังก์ชันในเมนู
v. 2.1 - แก้ไขบัคต่างๆ

Last update 04/02/2022
""")

money = ("""      <b>-------------------- ธนาคาร --------------------</b>
ธนาคารกสิกรไทย 💸
<b>--></b> <code>0973090410</code>

ธนาคารไทยพาณิชย์ 💸
<b>--></b> <code>4250965672</code>

ธนาคารกรุงไทย 💸
<b>--></b> <code>6608014732</code>

ธนาคารกรุงศรีอยุธยา 💸
<b>--></b> <code>8004950025</code>

<b>-------------------- วอเล็ท --------------------</b>
ทรูวอเล็ท 👛
<b>--></b> <code>0910682759</code>
<b>--></b> <code>0910585859</code>

ช้อปปี้เพย์ 👛
<b>--></b> <code>0629099131</code>

ปล. จิ้มที่ตัวเลขเพื่อคัดลอกได้เลย
ปลล. QR Code สำหรับสแกนอยู่ด้านล่าง
""")
